A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId UndeletedConstraintsInGroup { get; }
  Visual Basic
Public Shared ReadOnly Property UndeletedConstraintsInGroup As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ UndeletedConstraintsInGroup {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConstraintFailures Class
  Autodesk.Revit.DB Namespace